In [4]:
"""It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:"""

'It happens all the time: someone gives you data containing malformed strings,\nPython, lists and missing data. How do you tidy it up so you can get on with the\nanalysis?\nTake this monstrosity as the DataFrame to use in the following puzzles:'

In [7]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [23]:
df

,level_0,index,From_To,FlightNumber,RecentDelays,Airline
0,0,0,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,1,1,MAdrid_miLAN,10055,[],<Air France> (12)
2,2,2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,3,3,Budapest_PaRis,10075,[13],12. Air France
4,4,4,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

In [27]:
"""1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column)."""

"""for i in np.arange(1,df.From_To.count()+1):
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber']=df.FlightNumber.loc[i-1]+10
df['FlightNumber']
df"""
#df.fillna(0)
df

,level_0,index,From_To,FlightNumber,RecentDelays,Airline
0,0,0,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,1,1,MAdrid_miLAN,10055,[],<Air France> (12)
2,2,2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,3,3,Budapest_PaRis,10075,[13],12. Air France
4,4,4,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

In [28]:
# converting 'FlightNumber' from float to int 
df['FlightNumber'] = df['FlightNumber'].astype(int) 
df

,level_0,index,From_To,FlightNumber,RecentDelays,Airline
0,0,0,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,1,1,MAdrid_miLAN,10055,[],<Air France> (12)
2,2,2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,3,3,Budapest_PaRis,10075,[13],12. Air France
4,4,4,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

In [36]:
"""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
"""
data = df.copy()
data

data[['From','To']]=data.From_To.str.split('_',expand=True)
data

,level_0,index,From_To,FlightNumber,RecentDelays,Airline,From,To
0,0,0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,1,1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,2,2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,3,3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,4,4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [44]:
"""3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
"""

data.From = data.From.str.capitalize()
data.To = data.To.str.capitalize()
data.From_To = data.From_To.str.capitalize()

data

,level_0,index,From_To,FlightNumber,RecentDelays,Airline,From,To
0,0,0,London_paris,10045,"[23, 47]",KLM(!),London,Paris
1,1,1,Madrid_milan,10055,[],<Air France> (12),Madrid,Milan
2,2,2,London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,3,3,Budapest_paris,10075,[13],12. Air France,Budapest,Paris
4,4,4,Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,London

In [47]:
"""4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions."""
df
df.drop(['From_To'], axis = 1) 

df['From_To']=data['From_To']
df

,level_0,index,From_To,FlightNumber,RecentDelays,Airline
0,0,0,London_paris,10045,"[23, 47]",KLM(!)
1,1,1,Madrid_milan,10055,[],<Air France> (12)
2,2,2,London_stockholm,10065,"[24, 43, 87]",(British Airways. )
3,3,3,Budapest_paris,10075,[13],12. Air France
4,4,4,Brussels_london,10085,"[67, 32]","""Swiss Air"""

In [48]:
"""5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays."""

df 
rows = []
_ = df.apply(lambda row:[rows.append([row['Airline'],row['FlightNumber'],row['From_To'],nn,])])

,level_0,index,From_To,FlightNumber,RecentDelays,Airline
0,0,0,London_paris,10045,"[23, 47]",KLM(!)
1,1,1,Madrid_milan,10055,[],<Air France> (12)
2,2,2,London_stockholm,10065,"[24, 43, 87]",(British Airways. )
3,3,3,Budapest_paris,10075,[13],12. Air France
4,4,4,Brussels_london,10085,"[67, 32]","""Swiss Air"""